{
  "version": "2.5.39",
  "lastUpdated": "2025-08-16T04:47:47Z",
  "deployHistory": [
    {
      "version": "2.5.39",
      "date": "2025-08-16T04:47:47Z",
      "changes": "Admin system complete rewrite with intelligent AI prompts for business insights"
    },
    {
      "version": "2.5.38",
      "date": "2025-08-15T04:04:13Z",
      "changes": "GALLERY SIMPLIFIED: Removed all embedded images. Gallery now directly links to Google Business Profile where all 211+ actual photos are hosted. Clean, simple solution as requested."
    },
    {
      "version": "2.5.36",
      "date": "2025-08-15T03:55:23Z",
      "changes": "GALLERY FIXED: Replaced duplicate Squarespace images with diverse portfolio showing actual work - 1 Google Business photo + 7 service images from '11 Hair' series. All 8 images unique and load correctly. Verified with Puppeteer testing."
    },
    {
      "version": "2.5.34",
      "date": "2025-08-14T22:26:51Z",
      "changes": "FIXED: Replaced broken Google image URLs with working Squarespace CDN images that load correctly"
    },
    {
      "version": "2.5.33",
      "date": "2025-08-14T22:23:55Z",
      "changes": "FIXED GALLERY: Now displays actual Google Business Profile photos with category filtering. PERMANENTLY DELETED all generic wrong images so they can never be used again."
    },
    {
      "version": "2.5.32",
      "date": "2025-08-14T22:19:18Z",
      "changes": "RESTORED: Fixed gallery by restoring working Google Maps iframe gallery from version 2.5.26 - no more broken image links"
    },
    {
      "version": "2.5.31",
      "date": "2025-08-14T22:12:05Z",
      "changes": "Restored correct Signature Service image (woman with red hair in chair) for service card display"
    },
    {
      "version": "2.5.30",
      "date": "2025-08-14T22:09:49Z",
      "changes": "CRITICAL: Gallery now ONLY uses Google Business photos. Removed ALL local image references. Archived wrong images. Created permanent rules document."
    },
    {
      "version": "2.5.29",
      "date": "2025-08-14T22:04:51Z",
      "changes": "CRITICAL FIX: Restored correct service images - replaced wrong images with proper '11 Hair' series images for all services"
    },
  ]
}
