{
  "version": "2.8.4",
  "lastUpdated": "2025-11-26T17:30:00Z",
  "deployHistory": [
    {
      "version": "2.8.4",
      "date": "2025-11-26T17:30:00Z",
      "changes": "CRITICAL: Removed ALL hardcoded fake data from every admin page and ai-config.js. Microsites backlink counts now show '--' until API connected. Competitor fallbacks return empty arrays. Analytics fallbacks return null. NO FAKE DATA - all metrics require real API connections."
    },
    {
      "version": "2.8.3",
      "date": "2025-11-26T16:30:00Z",
      "changes": "Competitors chart now shows all 10 competitors with score labels on top of each bar. Added chartjs-plugin-datalabels for better readability. X-axis labels rotated 45 degrees to fit all names."
    },
    {
      "version": "2.8.2",
      "date": "2025-11-26T16:15:00Z",
      "changes": "Fixed all admin page rendering issues. Traffic page charts now display correctly with proper container heights. Dashboard NaN review gap fixed. Competitors page seoScore property fixed. All 7 admin pages verified working with live GA4 data."
    },
    {
      "version": "2.8.1",
      "date": "2025-11-26T14:55:00Z",
      "changes": "GA4 credentials configured. Added @google-analytics/data to root package.json for Vercel serverless functions."
    },
    {
      "version": "2.8.0",
      "date": "2025-11-26T17:00:00Z",
      "changes": "MAJOR: Complete SEO Analysis Engine built. NEW APIs: /api/ga4-analytics (7 data types), /api/seo-analysis-engine (trend detection, action generation, health scoring), /api/weekly-seo-report (automated weekly analysis). FREE TIER compatible - no Vercel Pro needed. All dashboards now use real GA4 API with proper disconnected states. Engine ready - just needs GA4 credentials to unlock all data."
    },
    {
      "version": "2.7.2",
      "date": "2025-11-26T16:00:00Z",
      "changes": "Restored Microsites page with REAL microsite domains (bestsalondelray.com, bestdelraysalon.com, bestsalonpalmbeach.com). All 3 verified LIVE with GA tracking G-XQDLWZM5NV. Added Microsites to unified navigation. Traffic data awaiting GA4 Property ID from client."
    },
    {
      "version": "2.7.0",
      "date": "2025-11-26T14:00:00Z",
      "changes": "MAJOR: Autonomous SEO Agent system launched. Unified 6-page admin dashboard (Dashboard, Traffic, Competitors, Rankings, Authority, Agent Log). SQLite database for historical tracking. Auto-refresh every 5 minutes. Weekly analysis scheduled for Sundays 6 AM EST."
    },
    {
      "version": "2.6.16",
      "date": "2025-11-26T12:00:00Z",
      "changes": "Added cache-busting meta tags to all admin pages to force browser refresh. All pages now use /api/admin-data endpoints."
    },
    {
      "version": "2.6.15",
      "date": "2025-11-26T11:00:00Z",
      "changes": "Fixed all admin pages to use working /api/admin-data endpoints. SEO score tracker, analytics command center, visitor metrics, engagement tracker all now fetch real API data."
    },
    {
      "version": "2.6.14",
      "date": "2025-11-26T10:00:00Z",
      "changes": "ZERO hardcoded data: All admin dashboards now fetch live API data. New analytics API endpoint, SEO Action Plan hub with virtuous cycle engine, reorganized navigation by importance"
    },
    {
      "version": "2.6.13",
      "date": "2025-11-26T09:00:00Z",
      "changes": "Major SEO upgrade: 5 dedicated service landing pages (wedding, balayage, color-correction, extensions, keratin), visitor metrics dashboard, SEO score tracker, engagement tracker, updated navigation with services dropdown"
    },
    {
      "version": "2.6.12",
      "date": "2025-11-26T08:00:00Z",
      "changes": "Fixed competitors page spinner stuck - destroy chart before recreating, better error handling"
    },
    {
      "version": "2.6.11",
      "date": "2025-11-26T07:30:00Z",
      "changes": "Fixed dashboard Error - added null checks for DOM elements, score now loads correctly"
    },
    {
      "version": "2.6.10",
      "date": "2025-11-26T07:15:00Z",
      "changes": "Fixed version badge showing on all admin pages, updated Claude model to claude-3-5-haiku"
    },
    {
      "version": "2.6.9",
      "date": "2025-11-26T07:00:00Z",
      "changes": "Removed redundant GitHub Actions workflow - Vercel auto-deploys natively, no more failure emails"
    },
    {
      "version": "2.6.8",
      "date": "2025-11-26T06:45:00Z",
      "changes": "Version badge added to ALL admin page headers - always shows current version"
    },
    {
      "version": "2.6.7",
      "date": "2025-11-26T06:30:00Z",
      "changes": "Analyze with AI button now shows LIVE/Cached status + timestamp when data was refreshed"
    },
    {
      "version": "2.6.6",
      "date": "2025-11-26T06:15:00Z",
      "changes": "Google Places + Claude AI integration - LIVE competitor data and AI recommendations"
    },
    {
      "version": "2.6.5",
      "date": "2025-11-26T06:00:00Z",
      "changes": "PageSpeed API now uses FREE tier - no API key required, live SEO analysis works"
    },
    {
      "version": "2.6.4",
      "date": "2025-11-26T05:35:00Z",
      "changes": "All admin pages now dynamic: index, competitors, rankings load from API"
    },
    {
      "version": "2.6.3",
      "date": "2025-11-26T05:25:00Z",
      "changes": "Admin index.html now fetches all data from API - no hardcoded data"
    },
    {
      "version": "2.6.2",
      "date": "2025-11-26T05:10:00Z",
      "changes": "Fixed admin ai-config.js to use production API, added tasks/analytics endpoints"
    },
    {
      "version": "2.6.1",
      "date": "2025-11-26T05:00:00Z",
      "changes": "Removed hardcoded version fallback, consolidated to single version.json, API endpoints working"
    },
    {
      "version": "2.5.50",
      "date": "2025-11-26T04:55:00Z",
      "changes": "Fixed invalid JSON (trailing comma) that prevented version display in footer"
    },
    {
      "version": "2.5.49",
      "date": "2025-11-26T04:30:00Z",
      "changes": "Moved API functions to root /api folder for Vercel serverless support"
    }
  ]
}
