{
  "version": "2.5.30",
  "lastUpdated": "2025-08-14T22:09:49Z",
  "deployHistory": [
    {
      "version": "2.5.30",
      "date": "2025-08-14T22:09:49Z",
      "changes": "CRITICAL: Gallery now ONLY uses Google Business photos. Removed ALL local image references. Archived wrong images. Created permanent rules document."
    },
    {
      "version": "2.5.29",
      "date": "2025-08-14T22:04:51Z",
      "changes": "CRITICAL FIX: Restored correct service images - replaced wrong images with proper '11 Hair' series images for all services"
    },
    {
      "version": "2.5.28",
      "date": "2025-08-14T21:23:20Z",
      "changes": "Version 2.5.27: Added comprehensive SEO Intelligence Engine with 0-100 scoring system, fixed version consistency across all admin pages, updated README with accurate admin documentation"
    },
    {
      "version": "2.5.25",
      "date": "2025-08-14T20:49:58Z",
      "changes": "CRITICAL: Removed all fake data, added Google Analytics tracking, clean admin with only real features"
    },
    {
      "version": "2.5.24",
      "date": "2025-08-14T18:49:09Z",
      "changes": "Deploy all 9 admin pages - performance, seo, reviews, market intel added with real data"
    },
    {
      "version": "2.5.23",
      "date": "2025-08-14T18:16:23Z",
      "changes": "Fix chart sizing issues: Added proper height containers (h-64, h-80) to all charts to prevent elongated display"
    },
    {
      "version": "2.5.22",
      "date": "2025-08-14T15:03:44Z",
      "changes": "Complete admin rebuild v3.0: Clean 9-page architecture with consistent navigation, real API competitor analysis, keyword tracking with persistence, removed 8+ fragmented pages. Fixed microsite names to Best Salon Del Rey, Best Del Rey Salon, Best Salon Palm Beach"
    },
    {
      "version": "2.5.21",
      "date": "2025-08-14T13:34:38Z",
      "changes": "Fixed microsite names (Best Salon Del Rey, Best Del Rey Salon, Best Salon Palm Beach), unified navigation across all admin pages, added real competitor analysis with Google PageSpeed API integration"
    },
    {
      "version": "2.5.20",
      "date": "2025-08-13T20:32:22Z",
      "changes": "Fix JSON syntax error in version.json"
    },
  ]
}
